package chapter1;

public class ForLoop {
    public static void main(String[] args) {
        for (int a = 1; a <= 10; a++) {
            if(a < 10) System.out.print(a + ", ");
            else System.out.println(a);
        }

        for (int a = 1; a < 19; a += 2) {
            if(a < 17) System.out.print(a + ", ");
            else System.out.println(a);
        }
    }
}



//Цикълът служи за многократно изпълнение на набор от инструкции

//Принципна схема на цикъл

//for{инициализация; условие; итерация) {
//     инструкция 1;
//     ...
//     инструкция n;
//}

//В инициализация - се задава първоначалната стойност на променливата на цикъла;
//В условие - ако логическият израз връща true, цикълът for продължава да се изпълнява, ако връща false, тогава спира да се изпълнява;
//В итерация - се определя стойността, с която ще се изменя цикъла, на всяка итерация;

//итерация - повторение, (завъртане)

// ++ оператор за инкрементация (увеличение с еденица)
// -- оператор за декрементация (намаление с еденица)
